
clc
clear
x=[842 491 617 617 106 566 622 492 552 156 590 687 121 885 790 633 150 551 614];
y=[614 263 266 883 751 721 194 776 674 912 839 601 801 261 560 944 911 721 513]; 
z=[-10 -10 -30 -30 -20 -20 -40 -40 -40 -60 -60 -50 -50 20 20 20 20 -70 -10];     
plot3(x,y,z,'.R','Markersize',35);
grid on;
hold on
x=[842 491 617 617 106 566 622 492 552 156 590 687 121 885 790 633 150 551 614];
y=[614 263 266 883 751 721 194 776 674 912 839 601 801 261 560 944 911 721 513]; 
z=[-10 -10 -30 -30 -20 0 -40 -40 -40 -60 -60 -60 -50 20 20 20 20 -70 -10];     
plot3(x,y,z,'.B','Markersize',25);
grid on;
sz=65;
c=linspace(0,13,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time/s');
% colorbar([0.02,1]);  % ????a,b??×?±ê??c???í????d????????
% t=get(h,'YTickLabel');
% t=strcat(t,'s');
% % set(h,'YTickLabel',t);?????±?????ó??????????S
  set(h,'FontSize',24);  % ?è??×????ó??
% set(h,'ytick',[0:1:9]);% ?è??????·??§
grid on;
clc
clear
x=[570 765 84 871 913 912 350 801 685 62 77 866 400 593 574 738 593 915 551 659 347 189 963 516 464 392 64 458 413 915 876 357 143 567 247 90 290 539 532 757 690 380 678 710 195 542 357];
y=[104 241 369 641 675 636 746 613 60 132 427 380 442 274 242 346 275 815 891 669 370 693 410 439 543 845 792 305 448 815 855 404 374 849 326 814 861 657 174 793 540 172 203 804 633 663 404]; 
z=[20 20 20 20 20 10 10 10 10 0 0 0 0 0 0 -10 -10 -10 -10 -20 -20 -20 -20 -20 -20 -30 -30 -30 -30 -30 -30 -40 -50 -40 -40 -40 -60 -60 -60 -60 -60 -70 -70 -70 -60 -50 -50];     
plot3(x,y,z,'.R','Markersize',35);
grid on;
hold on
x=[570 765 84 871 913 912 350 801 685 62 77 866 400 593 574 738 593 915 551 659 347 189 963 516 464 392 64 458 413 915 876 357 143 567 247 90 290 539 532 757 690 380 678 710 195 542 357];
y=[104 241 369 641 675 636 746 613 60 132 427 380 442 274 242 346 275 815 891 669 370 693 410 439 543 845 792 305 448 815 855 404 374 849 326 814 861 657 174 793 540 172 203 804 633 663 404]; 
z=[20 20 20 20 20 10 10 10 10 0 0 0 0 0 0 -10 -10 -10 -10 -20 -20 -20 -20 -20 -20 -30 -30 -30 -30 -30 -30 -40 -50 -40 -40 -40 -60 -60 -60 -60 -60 -70 -70 -70 -60 -50 -50];       
plot3(x,y,z,'.B','Markersize',25);
grid on;



clc
clear
x=[84 39 382 642 540 491 722 626 926 310 458 257 39 692 913 1085 1023 993 992 1156 1160 1364 1336 1383 1458 1448 1351 1150 1579 1653 1631 1770 1805 1832 1832 1778 1817 1840 1785 1502 1702];
y=[610 1396 912 858 973 952 1023 1095 1007 326 1443 1494 1396 100 525 769 1223 1549 1734 1502 1691 1398 1494 1659 1061 754 355 72 683 725 1196 1492 1390 1921 1050 904 650 482 332 60 70]; 
z=[-80 -40 -40 -80 -40 -40 -40 -20 -40 -20 -20 -40 -40 -80 -20 -40 -40 20 -40 -40 -40 -80 -20 -40 -40 -20 -20 -80 -20 -40 -40 -20 -40 -80 -40 -40 -20 -80 -20 -20 -20];  
sz=85;
c=linspace(0,5,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
% plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time/s');
% colorbar([0.02,1]);  % 其中a,b为坐标，c为宽度，d为高度。
% t=get(h,'YTickLabel');
% t=strcat(t,'s');
% % set(h,'YTickLabel',t);每个时间点后面加上单位S
  set(h,'FontSize',32);  % 设置字体大小
% set(h,'ytick',[0:1:9]);% 设置取值范围
hold on
x=[56 56 56 56 56 56];
y=[614 614 614 614 614 614];
z=[20 20 20 20 20 20];
sz=85;
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
grid on;


clc
clear
x=[332 433 331 75 908 1186 1040 1365 1430 1423 1629 1766];
y=[185 308 576 1196 448 730 1185 253 969 1069 573 1253]; 
z=[-20 -20 -20 -40 -20 -60 -20 -20 -80 -20 -20 -40];  
plot3(x,y,z,'.R','Markersize',35);
grid on;
hold on

clc
clear
x=[605 753 907 1139 1152 1531 1538 1201 1423 854 475 296 582 1095 160 15 596 825 1643 1849];
y=[78 155 240 279 460 292 451 738 744 975 528 1237 1238 1298 1485 1710 1492 1790 1863 1315]; 
z=[-8 -8 -8 -8 -8 -8 -8 -8 -8 -8 -8 -8 -8 -8 -8 0 -8 -8 -8 -8];  
plot3(x,y,z,'.R','Markersize',35);
grid on;
hold on
clc
clear
x=[56 116 190 149 405 615 16 92 105 765 917 1112 963 1179 1105];
y=[172 150 111 258 269 291 486 699 800 99 194 275 717 680 717];
z=[-8 -8 -8 8 -8 -8 0 -8 -8 -8 -8 -8 -8 -8 -8];
plot3(x,y,z,'.R','Markersize',30);
grid on;
hold on


clc
clear
x=[56 190 120 149 405 615 765 917 1112 16 92 105 963 1179 1071];
y=[170 111 150 258 260 291 55 194 273 486 699 800 717 680 719];
z=[-8 -8 -8 8 -8 -8 -8 -8 -8 0 -8 -8 -8 -8 -8];
plot3(x,y,z,'.-',x,y,z,'.R','Markersize',35);
grid on;
hold on
clc
clear
x=[87.5 83.4 80.5 77.8 74.2 71.4 68.6 65.8 63.0 59.8 56.4 52.5 49.5 44.4 40.5 36.4 33.6 28.6 25.1 21.6 17.4 14.3];
y=[12.4 16.6 21.2 26.1 34.9 53.6 54.9 64 75.6 86.1 96.6 104 112.4 119 125 131.4 136.3 141.5 146.4 150.3 156 157];
z=[-40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40];
plot3(x,y,z,'.-',x,y,z,'.Y','Markersize',25);
hold on
x=[167.6 162.3 158.5 155 151.4 149 145.5 143 139.5 136.4 131.8 127.9 124.4 118.1 113.9 108.3 104.4];
y=[25.4 29.9 34.9 39.8 49.6 57.3 70.7 81.2 93.4 105.4 117.3 126.1 133.8 142.9 149.6 157 162.2];
z=[-40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40];
plot3(x,y,z,'.-',x,y,z,'.R','Markersize',25);
hold on 
x=[180.9 175.3 170.7 166.9 163.0 160 156.7 153.6 150 146.5 141.6 136.7 132.5 126.9 121.6];
y=[29.3 34.2 39.4 44.7 55.2 64 78 89.6 102.6 115.9 128.9 138.7 147.1 157 163.6];
z=[-40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40];
plot3(x,y,z,'.-',x,y,z,'.B','Markersize',25);
hold on
x=[49 44.8 40.9 37.1 32.1 27.9 23 17.4 12.9 6.9];
y=[16.6 29.3 44.3 59.4 72.8 83.3 92.1 101.9 110.3 118.7];
z=[-40 -40 -40 -40 -40 -40 -40 -40 -40 -40];
plot3(x,y,z,'.-',x,y,z,'.G','Markersize',25);
hold on
x=[88.3 86.5 83.0 80.6 76.4 72.9 69.3 64.8 60.9 56.7 53.2 48.6 44.8 41.6 37.1 34.6 29];
y=[22.2 31.7 44.3 56.3 66.8 75.9 82.9 91 97.3 103.6 109.6 114.9 120.1 124.3 129.6 133.5 139];
z=[-40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40 -40];
plot3(x,y,z,'.-',x,y,z,'.C','Markersize',25);
grid on;


clc
close all
clear
x=[198.1 182 163.7 148.3 133.2 115.3 99.2 85.1 69.7 56 43];
y=[83.3 90.3 99.3 103.3 110 117.3 123.3 129 135.2 140.8 146.1];
z=[-60 -60 -60 -60 -60 -60 -60 -60 -60 -60 -60];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z);
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[110 99.8 90.4 86.5];
y=[82.2 86.1 90.3 96.9];
z=[0 0 0 0];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
colorbar;
grid on; 
 x=[93.2 76 56 38.8 22];
 y=[63.6 70.3 78.4 84.7 91.7];
 z=[-80 -80 -80 -80 -80];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[139.5 126.2 110.7 97.4 84.4 69.3];
y=[131 137 143 147.9 154.5 159.4];
z=[-60 -60 -60 -60 -60 -60];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[78.5 60.9 49.3 42 31.4 26.5 22];
y=[79.1 86.1 90.7 94.2 98 99.4 101.5];
z=[-20 -20 -20 -20 -20 -20 -20];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[186.8 165.8 141.3 117.7 97.8 76.3 58.8 39.2]; 
y=[34.5 42.9 52.8 61.2 68.2 76.6 82.2 90.3];
z=[-80 -80 -80 -80 -80 -80 -80 -80];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[173.2 166.5 156.7 141.6 132.9 123.7 109 95.7];
y=[62.2 65.7 69.6 76.3 79.8 83.3 89.3 94.5];
z=[-20 -20 -20 -20 -20 -20 -20 -20];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on; 
x=[132.5 111.4 88.3 67.9 48.3 25.8 4.4];
y=[99.4 107.5 117 125.4 132.4 140.5 149.6];
z=[-80 -80 -80 -80 -80 -80 -80];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[215.7 197.1 179.5 165.8 150 137.1 122];
y=[122.5 130 137.7 142.9 150 155.6 162];
z=[-60 -60 -60 -60 -60 -60 -60];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[108 93.9 77.4 62.7];
y=[141.5 147.9 154.2 160];
z=[-60 -60 -60 -60];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;
x=[204.1 190.7 176.7 164.4 151.8];
y=[77.3 82.9 88.2 92.8 98.7];
z=[-60 -60 -60 -60 -60];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on; 
x=[207.6 192.9 180.6 168 154 140.2 128.3];
y=[129.3 135.2 140.5 146.1 151.7 160 161.9];
z=[-60 -60 -60 -60 -60 -60 -60];
sz=65;
c=linspace(0,6,length(x));
scatter3(x,y,z,sz,c,'filled');hold on
plot3(x,y,z,'-');
map=colormap(flipud(parula));
h=colorbar;
set(get(h,'Title'),'string','time:s');
set(h,'FontSize',16);  % 设置字体大小
grid on;



clc
clear
x=[52.1 89 31.4 127.9 141.3 168.3 159.5 188.3 147.2];
y=[64.3 100.5 149.6 110.6 93.5 103.3 69.6 45.7 30.7];
z=[-20 -20 -20 0 -20 -20 -60 -60 -60];
plot3(x,y,z,'.B','Markersize',30);
hold on
x=[52.1 89 31.4 127.9 141.3 168.3 159.5 188.3 147.2];
y=[64.3 100.5 149.6 110.6 93.5 103.3 69.6 45.7 30.7];
z=[-20 -20 -20 0 -20 -20 -60 -40 -60];
plot3(x,y,z,'.R','Markersize',20);
grid on





